---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.SetExportLayerTable(Autodesk.Revit.DB.ExportLayerTable)
source: html/9d1bb366-8472-4141-945b-47a6b02fe1e7.htm
---
# Autodesk.Revit.DB.BaseExportOptions.SetExportLayerTable Method

Sets layer table back to option

## Syntax (C#)
```csharp
public void SetExportLayerTable(
	ExportLayerTable layerTable
)
```

## Parameters
- **layerTable** (`Autodesk.Revit.DB.ExportLayerTable`) - The layer table to be set

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null